In [1]:
from prettytable import PrettyTable

In [4]:
t=PrettyTable()
t.field_names=["Last Name,", 'First name, ' ,'income', 'age']
t.add_row(["Иванов",'Иван',100,100000])
t.add_row(["Петров",'Петр',19,100])
t.add_row(["Сидоров",'Ян',30,50000])
print(t)

+------------+--------------+--------+--------+
| Last Name, | First name,  | income |  age   |
+------------+--------------+--------+--------+
|   Иванов   |     Иван     |  100   | 100000 |
|   Петров   |     Петр     |   19   |  100   |
|  Сидоров   |    сидор     |   30   | 50000  |
+------------+--------------+--------+--------+

In [5]:
t.add_rows([
    ["Янов", "Ян", 1,2],
    ["Орлов", "николай", 10,20],
    ["Александров", "Александр", 100,200],
    ])

In [6]:
t

+-------------+--------------+--------+--------+
|  Last Name, | First name,  | income |  age   |
+-------------+--------------+--------+--------+
|    Иванов   |     Иван     |  100   | 100000 |
|    Петров   |     Петр     |   19   |  100   |
|   Сидоров   |    сидор     |   30   | 50000  |
|     Янов    |      Ян      |   1    |   2    |
|    Орлов    |   николай    |   10   |   20   |
| Александров |  Александр   |  100   |  200   |
+-------------+--------------+--------+--------+

In [7]:
print(t.get_string())

+-------------+--------------+--------+--------+
|  Last Name, | First name,  | income |  age   |
+-------------+--------------+--------+--------+
|    Иванов   |     Иван     |  100   | 100000 |
|    Петров   |     Петр     |   19   |  100   |
|   Сидоров   |    сидор     |   30   | 50000  |
|     Янов    |      Ян      |   1    |   2    |
|    Орлов    |   николай    |   10   |   20   |
| Александров |  Александр   |  100   |  200   |
+-------------+--------------+--------+--------+

In [8]:
t2=t
t3=t[:-1]
t3

+------------+--------------+--------+--------+
| Last Name, | First name,  | income |  age   |
+------------+--------------+--------+--------+
|   Иванов   |     Иван     |  100   | 100000 |
|   Петров   |     Петр     |   19   |  100   |
|  Сидоров   |    сидор     |   30   | 50000  |
|    Янов    |      Ян      |   1    |   2    |
|   Орлов    |   николай    |   10   |   20   |
+------------+--------------+--------+--------+

In [10]:
t.align["Last Name,"]='l'
t.align["age"]='s'
t

+-------------+--------------+--------+--------+
| Last Name,  | First name,  | income |  age   |
+-------------+--------------+--------+--------+
| Иванов      |     Иван     |  100   | 100000 |
| Петров      |     Петр     |   19   |  100   |
| Сидоров     |    сидор     |   30   | 50000  |
| Янов        |      Ян      |   1    |   2    |
| Орлов       |   николай    |   10   |   20   |
| Александров |  Александр   |  100   |  200   |
+-------------+--------------+--------+--------+

In [11]:
print(t.get_string(sortby="age"))

+-------------+--------------+--------+--------+
| Last Name,  | First name,  | income |  age   |
+-------------+--------------+--------+--------+
| Янов        |      Ян      |   1    |   2    |
| Орлов       |   николай    |   10   |   20   |
| Петров      |     Петр     |   19   |  100   |
| Александров |  Александр   |  100   |  200   |
| Сидоров     |    сидор     |   30   | 50000  |
| Иванов      |     Иван     |  100   | 100000 |
+-------------+--------------+--------+--------+